app/Controllers/Admin/Invoices.php

INSERT INTO `order_label_invoice` (`invoice_id`, `source_id`, `label`) VALUES (15632, '3', 'DITANGANI OLEH DEVANO')
---
                    'source_id'  => $this->request->getPost('asal_orderan'),
                    'label'      => ($this->request->getPost('label') !== '' ? $this->request->getPost('label') : null),
                ];
                $db->table('label_invoice')->insert($data_asal);

DELETE FROM `order_label_invoice`
WHERE `invoice_id` = '15632'
---
                // $invoice_id = $db->insertID();

                // hapus data asal orderan
                $db->table('label_invoice')->delete(['invoice_id' => $invoice_id]);

INSERT INTO `order_label_invoice` (`invoice_id`, `source_id`, `label`) VALUES ('15632', '3', 'DITANGANI OLEH DEVANO')
---
                    'source_id'  => $this->request->getPost('asal_orderan'),
                    'label'      => ($this->request->getPost('label') !== '' ? $this->request->getPost('label') : null),
                ];
                $db->table('label_invoice')->insert($data_asal);