app/Models/LabelInvoice.php

SELECT `label`, `source_id` as `id`
FROM `order_label_invoice`
WHERE `invoice_id` = '15627'
 LIMIT 1
---
    public function getSimple( $invoice_id): ?object
    {
        return $this->select('label, source_id as id')
            ->where('invoice_id', $invoice_id)
            ->first();